[{"id":"baf9161c-0318-44db-9a0e-3b98ff1285ea","title":"What Is the Comfort Zone in Psychology?","text":"Now firmly embedded in cultural discourse, the metaphor of ‘leaving one’s comfort zone’ became popular in the 1990s. The phrase ‘comfort zone’ was coined by management thinker Judith Bardwick in her 1991 work Danger in the Comfort Zone:\r\n\r\n“The comfort zone is a behavioral state within which a person operates in an anxiety-neutral condition, using a limited set of behaviors to deliver a steady level of performance, usually without a sense of risk.”","image":"81dcb3ff-b9ed-42f6-9a35-50c9fa722e0d.jpeg","views":0,"fav":true},{"id":"d3b509a7-9094-494c-a87e-b0b62a10030b","title":"What Is the Comfort Zone in Psychology?","text":"Now firmly embedded in cultural discourse, the metaphor of ‘leaving one’s comfort zone’ became popular in the 1990s. The phrase ‘comfort zone’ was coined by management thinker Judith Bardwick in her 1991 work Danger in the Comfort Zone:\r\n\r\n“The comfort zone is a behavioral state within which a person operates in an anxiety-neutral condition, using a limited set of behaviors to deliver a steady level of performance, usually without a sense of risk.”","image":"d40a0e1b-000d-4ff4-ae4b-ff7474a9d435.jpeg","views":0,"fav":true},{"id":"2f4b0e13-32bb-48bc-8e47-f7aacee57727","title":"Why COVID-19 policy should explicitly consider men's health","text":"All data and statistics are based on publicly available data at the time of publication. Some information may be out of date. Visit our coronavirus hub and follow our live updates page for the most recent information on the COVID-19 pandemic.\r\n\r\nHaving a gendered response to COVID-19 might have led to the pandemic having far less of an impact on health and the U.S. economy. This gendered response should include women’s disproportionate social and economic burdens and men’s higher rate of mortality.\r\n\r\nThere is a current and urgent need to prioritize men’s health related to the COVID-19 response, yet neither the strategy of the former administrationTrusted Source nor that of the current administration considers these gendered patterns.","image":"7340f06d-f698-4e96-9857-cb19de347d7b.jpeg","views":0,"fav":true}]